tests/airfoil_unsteady/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet_1|outlet_2)"
    {
        type            calculated;
        value           uniform 0;
    }
    symplane_3
    {
        type            empty;
    }
    wall_4
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
